tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "awscli"
brew "bat"
brew "clang-format"
brew "docker"
brew "exa"
brew "fasd"
brew "fd"
brew "go"
brew "mysql", restart_service: true
brew "neovim"
brew "nodebrew"
brew "nvm"
brew "peco"
brew "pyenv"
brew "ripgrep"
brew "rustup-init"
brew "screenfetch"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "ydiff"
brew "zplug"
cask "clipy"
cask "dash"
cask "docker"
cask "dropbox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "shiftit"
cask "slack"
cask "visual-studio-code"
cask "alfred"
