tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "aquasecurity/trivy"
tap "azure/azd"
tap "azure/azure-workload-identity"
tap "hashicorp/tap"
tap "localstack/tap"
tap "mongodb/brew"
tap "supabase/tap"
tap "suzuki-shunsuke/ci-info"
tap "twilio/brew"

# CLI tools
brew "bat"
brew "clang-format"
brew "cmake"
brew "dasel"
brew "docker"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-secrets"
brew "gnu-sed"
brew "go"
brew "grpcurl"
brew "helmfile"
brew "jj"
brew "jq"
brew "k6"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "llama.cpp"
brew "mprocs"
brew "mysql", restart_service: true
brew "neovim"
brew "nkf"
brew "nodenv"
brew "nvm"
brew "opa"
brew "openapi-generator"
brew "pdftk-java"
brew "peco"
brew "pipx"
brew "postgresql@14", restart_service: true
brew "pre-commit"
brew "promptfoo"
brew "pyenv"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust"
brew "rustup"
brew "screenfetch"
brew "sheldon"
brew "supabase/tap/supabase"
brew "terraform-ls"
brew "tfenv"
brew "tig"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "vegeta"
brew "vim"
brew "watchman"
brew "wget"
brew "whisper-cpp"
brew "wireshark"
brew "yarn"
brew "ydiff"
brew "yq"
brew "zoxide"
brew "zplug"

# Cloud / DevOps
brew "azure/azd/azd"
brew "azure/azure-workload-identity/azwi"
brew "aquasecurity/trivy/trivy"
brew "localstack/tap/localstack-cli"
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-community-shell"
brew "suzuki-shunsuke/ci-info/ci-info"
brew "twilio/brew/twilio"
brew "azure-cli"
brew "grpc"

# Apps
cask "adobe-acrobat-reader"
cask "alfred"
cask "aqua-voice"
cask "burp-suite"
cask "chatgpt"
cask "clipy"
cask "cursor-cli"
cask "dash"
cask "devtoys"
cask "devutils"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "jasper-app"
cask "karabiner-elements"
cask "lm-studio"
cask "microsoft-teams"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "session-manager-plugin"
cask "slack"
cask "visual-studio-code"
cask "wireshark-app"
