tap "aquasecurity/trivy"
tap "azure/azd"
tap "azure/azure-workload-identity"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "localstack/tap"
tap "mongodb/brew"
tap "supabase/tap"
tap "coderabbitai/tap"
tap "suzuki-shunsuke/ci-info"
tap "twilio/brew"

# CLI tools
brew "bat"
brew "clang-format"
brew "cmake"
brew "dasel"
brew "docker", link: false
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "git"
brew "coderabbitai/tap/git-gtr"
brew "git-secrets"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "jj"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "mprocs"
brew "neovim"
brew "nkf"
brew "peco"
brew "ripgrep"
brew "screenfetch"
brew "sheldon"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "ydiff"
brew "yq"
brew "zoxide"
brew "zplug"
brew "zsh"

# Languages / Runtimes
brew "go"
brew "node"
brew "node-build"
brew "nodenv"
brew "nvm"
brew "perl"
brew "pipenv"
brew "pipx"
brew "pyenv"
brew "rbenv"
brew "ruby-build"
brew "rust"
brew "rustup"
brew "virtualenv"
brew "yarn"

# Databases
brew "mongodb/brew/mongodb-community"
brew "mongodb/brew/mongodb-community-shell", link: false
brew "mongosh"
brew "mysql"
brew "postgresql@14"
brew "redis"

# Cloud / DevOps
brew "azure-cli"
brew "azure/azd/azd"
brew "azure/azure-workload-identity/azwi"
brew "aquasecurity/trivy/trivy"
brew "grpc"
brew "grpcurl"
brew "helm"
brew "helmfile"
brew "k6"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "kustomize"
brew "localstack/tap/localstack-cli"
brew "opa"
brew "pre-commit"
brew "supabase/tap/supabase"
brew "suzuki-shunsuke/ci-info/ci-info"
brew "terraform-ls"
brew "tfenv"
brew "twilio/brew/twilio"
brew "vegeta"

# AI
brew "llama.cpp"
brew "promptfoo"
brew "whisper-cpp"

# Misc
brew "openapi-generator"
brew "pdftk-java"
brew "poppler"
brew "portaudio"
brew "watchman"
brew "wireshark"

# Apps
cask "adobe-acrobat-reader"
cask "alfred"
cask "aqua-voice"
cask "burp-suite"
cask "chatgpt"
cask "chatgpt-atlas"
cask "claude"
cask "claude-code"
cask "clipy"
cask "codex"
cask "cursor-cli"
cask "dash"
cask "devtoys"
cask "devutils"
cask "docker-desktop"
cask "dropbox"
cask "fig"
cask "firefox"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-chrome@canary"
cask "google-chrome@dev"
cask "iterm2"
cask "jasper-app"
cask "karabiner-elements"
cask "lm-studio"
cask "microsoft-teams"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "session-manager-plugin"
cask "slack"
cask "visual-studio-code"
cask "wireshark-app"

# VS Code Extensions
vscode "1yib.rust-bundle"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "dbaeumer.vscode-eslint"
vscode "dustypomerleau.rust-syntax"
vscode "edonet.vscode-command-runner"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.openai-chatgpt-adhoc"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shanejarvie.hybrid-theme"
vscode "streetsidesoftware.code-spell-checker"
vscode "undefined_publisher.fuzzy-fuzzy"
vscode "vscodevim.vim"
vscode "withfig.fig"
